import { ImageSourcePropType } from 'react-native';

export interface NewsItem {
    id: number;
    type: string;
    category: string;
    title: string;
    subtitle: string;
    imagetitle?: string;
    shortdesc: string;
    img: ImageSourcePropType;
    like: number;
    dislike: number;
    comment: number;
}

export const newsConst: NewsItem[] = [
    {
        id: 1,
        type: 'template-1',
        category: 'వినోదం',
        title: 'ఒకేసారి మూడు రకాల సమస్యలు చుట్టుముట్టాయి',
        subtitle: 'సమంత',
        shortdesc:
            "ఒకేసారి మూడు రకాల సమస్యలు చుట్టుముట్టాయి.. ఎంతో బాధపడ్డాను '' అని నటి సమంత అన్నారు. స్టార్‌ హీరోయిన్‌ సమంత ప్రస్తుతం సినిమాలకు విరామం ప్రకటించి పూర్తి సమయాన్ని ఆరోగ్య సంరక్షణకు కేటాయించారు. తాజాగా ఆమె ఓ ఆంగ్ల మీడియా సంస్థతో మాట్లాడుతూ ... తన విడాకులు, వరుస ఫ్లాప్‌లు, ఆరోగ్య సమస్యలు అన్నీ ఒకేసారి చుట్టుముట్టడంతో తాను ఎంతో కుంగిపోయినట్లు తెలిపారు.",
        img: require('../assets/template_1.png'),
        like: 230,
        dislike: 10,
        comment: 43
    },
    {
        id: 2,
        type: 'template-2',
        category: 'రాజకీయం.',
        title: 'గజ్వేల్, కామారెడ్డిలో సీఎం కేసీఆర్',
        subtitle: 'నామినేషన్',
        shortdesc:
            'తెలంగాణ సీఎం కేసీఆర్ గజ్వేల్, కామారెడ్డి నియోజక వర్గాల్లో నామినేషన్ దాఖలు చేశారు. అటు, మంత్రి కేటీఆర్ సిరిసిల్లలో, మంత్రి హరీష్ రావు సిద్ధిపేటలో నామినేషన్ వేశారు.',
        img: require('../assets/template_2.png'),
        like: 230,
        dislike: 10,
        comment: 43
    },
    {
        id: 3,
        type: 'template-3',
        category: 'రాజకీయం.',
        title: 'కాంగ్రెసులోకి',
        subtitle: 'తీన్మార్ మల్లన్న',
        imagetitle: 'ఠాక్రే సమక్షంలో చేరిక ఈసారి పోటీకి దూరమేనా ?',
        shortdesc:
            'తెలంగాణ సీఎం కేసీఆర్ గజ్వేల్, కామారెడ్డి నియోజక వర్గాల్లో నామినేషన్ దాఖలు చేశారు. అటు, మంత్రి కేటీఆర్ సిరిసిల్లలో, మంత్రి హరీష్ రావు సిద్ధిపేటలో నామినేషన్ వేశారు.',
        img: require('../assets/template_3.png'),
        like: 230,
        dislike: 10,
        comment: 43
    },
    {
        id: 4,
        type: 'template-4',
        category: 'రాజకీయం.',
        title: 'కేంద్రానికి వినతిలోనూ జాప్యమే !',
        subtitle: '',
        shortdesc:
            'యావత్‌ రాష్ట్రాన్నీ దుర్భిక్షం పీడిస్తున్న సమయాన, కరువు మండలాల గుర్తింపే లోపభూయిష్టంకాగా, ప్రకటించిన మేరకైనా కేంద్రాన్ని సకాలంలో నిధులడిగే విషయంలో రాష్ట్ర ప్రభుత్వం తాత్సారం చేస్తోంది. కేంద్ర కరువు మాన్యువల్‌ ప్రకారం కరువును ప్రకటిస్తూ గెజిట్‌ విడుదల చేసిన వారంలో కేంద్రాన్ని సహాయం కోరుతూ రాష్ట్ర సర్కారు సమగ్ర విజ్ఞాపన పత్రం సమర్పించాలి.',
        img: require('../assets/template_4.png'),
        like: 230,
        dislike: 10,
        comment: 43
    },
    {
        id: 5,
        type: 'template-5',
        category: 'రాజకీయం.',
        title: 'కేంద్రానికి వినతిలోనూ జాప్యమే !',
        subtitle: '',
        shortdesc:
            'యావత్‌ రాష్ట్రాన్నీ దుర్భిక్షం పీడిస్తున్న సమయాన, కరువు మండలాల గుర్తింపే లోపభూయిష్టంకాగా, ప్రకటించిన మేరకైనా కేంద్రాన్ని సకాలంలో నిధులడిగే విషయంలో రాష్ట్ర ప్రభుత్వం తాత్సారం చేస్తోంది. కేంద్ర కరువు మాన్యువల్‌ ప్రకారం కరువును ప్రకటిస్తూ గెజిట్‌ విడుదల చేసిన వారంలో కేంద్రాన్ని సహాయం కోరుతూ రాష్ట్ర సర్కారు సమగ్ర విజ్ఞాపన పత్రం సమర్పించాలి.',
        img: require('../assets/template_5.png'),
        like: 230,
        dislike: 10,
        comment: 43
    },
    {
        id: 6,
        type: 'recommend',
        category: 'రాజకీయం.',
        title: 'కేంద్రానికి వినతిలోనూ జాప్యమే !',
        subtitle: '',
        shortdesc:
            'యావత్‌ రాష్ట్రాన్నీ దుర్భిక్షం పీడిస్తున్న సమయాన, కరువు మండలాల గుర్తింపే లోపభూయిష్టంకాగా, ప్రకటించిన మేరకైనా కేంద్రాన్ని సకాలంలో నిధులడిగే విషయంలో రాష్ట్ర ప్రభుత్వం తాత్సారం చేస్తోంది. కేంద్ర కరువు మాన్యువల్‌ ప్రకారం కరువును ప్రకటిస్తూ గెజిట్‌ విడుదల చేసిన వారంలో కేంద్రాన్ని సహాయం కోరుతూ రాష్ట్ర సర్కారు సమగ్ర విజ్ఞాపన పత్రం సమర్పించాలి.',
        img: require('../assets/template_5.png'),
        like: 230,
        dislike: 10,
        comment: 43
    },
    {
        id: 7,
        type: 'share-feed',
        category: 'రాజకీయం.',
        title: 'కేంద్రానికి వినతిలోనూ జాప్యమే !',
        subtitle: '',
        shortdesc:
            'యావత్‌ రాష్ట్రాన్నీ దుర్భిక్షం పీడిస్తున్న సమయాన, కరువు మండలాల గుర్తింపే లోపభూయిష్టంకాగా, ప్రకటించిన మేరకైనా కేంద్రాన్ని సకాలంలో నిధులడిగే విషయంలో రాష్ట్ర ప్రభుత్వం తాత్సారం చేస్తోంది. కేంద్ర కరువు మాన్యువల్‌ ప్రకారం కరువును ప్రకటిస్తూ గెజిట్‌ విడుదల చేసిన వారంలో కేంద్రాన్ని సహాయం కోరుతూ రాష్ట్ర సర్కారు సమగ్ర విజ్ఞాపన పత్రం సమర్పించాలి.',
        img: require('../assets/template_5.png'),
        like: 230,
        dislike: 10,
        comment: 43
    }
]